In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
myList = [10, 20, 30, 40, 50]
myLabels = ['a', 'b', 'c', 'd', 'e']

In [4]:
s1 = pd.Series(myList)
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
s1[0]

10

In [6]:
s2 = pd.Series(data=myList, index=myLabels)
s2

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [7]:
s2[0]

10

In [8]:
s2['a']

10

# DataFrame

In [11]:
df = pd.DataFrame(data=np.random.randint(1, 101, (4, 5)), 
            index=['A', 'B', 'C', 'D'], 
            columns=['V', 'W', 'X', 'Y', 'Z'])

df

    V    W   X   Y   Z
A  78   59  76  35  42
B   8   42  22   7  66
C  15  100  91  15  87
D  66   29  83  71  85

In [12]:
df['W']

A     59
B     42
C    100
D     29
Name: W, dtype: int64

In [13]:
df['W']['C']

100

In [16]:
df[['W', 'Z']]

     W   Z
A   59  42
B   42  66
C  100  87
D   29  85

In [17]:
df.loc['B']

V     8
W    42
X    22
Y     7
Z    66
Name: B, dtype: int64

In [18]:
df.iloc[0]

V    78
W    59
X    76
Y    35
Z    42
Name: A, dtype: int64

In [19]:
df['New'] = [10, 10, 10, 10]

In [20]:
df

    V    W   X   Y   Z  New
A  78   59  76  35  42   10
B   8   42  22   7  66   10
C  15  100  91  15  87   10
D  66   29  83  71  85   10

In [21]:
df['New'] = [100, 100, 100, 100]

In [22]:
df

    V    W   X   Y   Z  New
A  78   59  76  35  42  100
B   8   42  22   7  66  100
C  15  100  91  15  87  100
D  66   29  83  71  85  100

In [24]:
df.drop('New', axis=1)

    V    W   X   Y   Z
A  78   59  76  35  42
B   8   42  22   7  66
C  15  100  91  15  87
D  66   29  83  71  85

In [25]:
df

    V    W   X   Y   Z  New
A  78   59  76  35  42  100
B   8   42  22   7  66  100
C  15  100  91  15  87  100
D  66   29  83  71  85  100

In [26]:
df.drop('New', axis=1, inplace=True)

In [27]:
df

    V    W   X   Y   Z
A  78   59  76  35  42
B   8   42  22   7  66
C  15  100  91  15  87
D  66   29  83  71  85

In [28]:
df.shape

(4, 5)